{
  "version": "https://jsonfeed.org/version/1",
  "title": "Vanity TLD",
  "home_page_url": "https://garytrakhman.com/",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "Longer than a tweet",
  "author": {
    "name": "Your Name Here",
    "url": "https://garytrakhman.com/about"
  },
  "items": [{
      "id": "https://garytrakhman.com/posts/firstpost/",
      "url": "https://garytrakhman.com/posts/firstpost/",
      "title": "New blog.",
      "content_html": "<p>I wanted to bring back my TLD, and I've been meaning to blog again<br>\nafter a long hiatus. It's not that I have anything specific to write<br>\nabout yet, but I do get opinionated about technical topics and<br>\noccasionally nontechnical topics as well.  The initial blog's (now<br>\ndeleted) purpose was to get my foot in the door into a development<br>\ncareer as technical marketing. In 2010 this seemed like a good idea,<br>\nbut many have also had that idea since then. Consequently, I've had<br>\ntrouble finding consistent content that I was motivated to read.<br>\nThere are a lot of intro-level articles made by and for the new<br>\ndeveloper.  Additionally, I can find something good to read on some<br>\nvery specialized and more difficult topics. At this point I'm too<br>\nimpatient for the easy reads and after paying attention for a minute<br>\nor two will jump into skim mode to see if there's anything worth a<br>\ncloser look.  For the harder reads, I either know too little about the<br>\ntopic or it would be too risky to apply in my place of work, so it can<br>\nfeel largely useless at that moment.</p>\n<p>Since then, twitter replaced blogging and reading blogs for me.<br>\nUnfortunately, while it is a nice way to find content and keep up with<br>\npeople, it promotes distracted thought. I think most can agree that<br>\nwhen writing larger blocks of text, you can more easily clarify each<br>\nthought and test it against your other thoughts to see if makes<br>\nsense. With the smaller format, it seems like I'm susceptible to<br>\ninterruption by (probably also distracted) people posting in<br>\nreal-time.</p>\n<p>So, when I ask myself what's the purpose of this blog, I think it's to<br>\nremove those distractions from my own thought process and to rebuild<br>\nmy own reading and writing habits.</p>\n",
      "date_published": "2021-02-16T00:00:00Z"
    }
  ]
}
