{
  "version": "https://jsonfeed.org/version/1",
  "title": "Vanity TLD",
  "home_page_url": "https://garytrakhman.com/",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "Longer than a tweet",
  "author": {
    "name": "Your Name Here",
    "url": "https://garytrakhman.com/about"
  },
  "items": [{
      "id": "https://garytrakhman.com/posts/firstpost/",
      "url": "https://garytrakhman.com/posts/firstpost/",
      "title": "New blog.",
      "content_html": "<p>I wanted to bring back my TLD, and I've been meaning to blog again<br>\nafter a long hiatus. It's not that I have anything specific to write<br>\nabout yet, but I do get opinionated about technical topics and<br>\noccasionally nontechnical topics as well.  The initial blog's (now<br>\ndeleted) purpose was to get my foot in the door into a development<br>\ncareer as technical marketing. In 2010 this seemed like a good idea,<br>\nbut many have that idea since then. Consequently, I've had trouble<br>\nfinding consistent content that I was motivated to read.  There are a<br>\nlot of intro-level articles made by and for the new developer.<br>\nAdditionally, I can find something good to read on some very<br>\nspecialized and more difficult topics. At this point I'm too impatient<br>\nfor the easy reads and after paying attention for a minute or two will<br>\njump into skim mode to see if there's anything worth a closer look.<br>\nFor the harder reads, I either know too little about the topic or it<br>\nwould be too risky to apply in my place of work, so it can feel<br>\nlargely useless.</p>\n<p>Since then, twitter largely replaced blogging and reading blogs for<br>\nme. Unfortunately, I think while it is a nice way to find content and<br>\nkeep up with people, it promotes distracted thought. I think most can<br>\nagree that when writing larger blocks, you can more easily clarify<br>\neach thought and test it against others. With the smaller format, it<br>\nseems like I'm susceptible to interruption by (probably also<br>\ndistracted) people posting in real-time.</p>\n<p>So, when I ask myself what's the purpose of this blog, I think it's to<br>\nremove those distractions from my own thought process and to rebuild<br>\nmy own reading and writing habits.</p>\n",
      "date_published": "2021-02-16T00:00:00Z"
    }
  ]
}
